#使用说明：输入目标位置，输出理论时差，具体参数修改请参照下文注释

x = float(input('请输入坐标x：'))
y = float(input('请输入坐标y：'))
#z = float(input('请输入坐标z：'))

c = 3.0e8
a=0.0

#此处为4站布站
#P1 = [0,0,1]
#P2 = [750,1229,2]
#P3 = [-750,1229,1]
#P4 = [0,-1500,0]

#此处为4站的坐标运算
#r1 =( (P1[0]-x)**2 + (P1[1]-y)**2 + (P1[2]-z)**2)**0.5  #无人机到基站1的距离
#r2 =( (P2[0]-x)**2 + (P2[1]-y)**2 + (P2[2]-z)**2)**0.5   #无人机到基站2的距离
#r3 =( (P3[0]-x)**2 + (P3[1]-y)**2 + (P3[2]-z)**2)**0.5    #无人机到基站3的距离
#r4 =( (P4[0]-x)**2 + (P4[1]-y)**2 + (P4[2]-z)**2)**0.5      #无人机到基站4的距离

#此处为3站的布站方式
P1 = [-866,500]#此处是布站方式，要修改布站方式请在此处修改
P2 = [866,500]#
P3 = [0,-1000]#

#此处为3站布站运算
r1 =( (P1[0]-x)**2 + (P1[1]-y)**2)**0.5  #无人机到基站1的距离
r2 =( (P2[0]-x)**2 + (P2[1]-y)**2)**0.5   #无人机到基站2的距离
r3 =( (P3[0]-x)**2 + (P3[1]-y)**2)**0.5    #无人机到基站3的距离
#r4 =( (P4[0]-x)**2 + (P4[1]-y)**2)**0.5      #无人机到基站4的距离
#if r1<r2:
#    a = r1
#    r1 = r2
#    r2 = a

#if r3<r2:
#    a = r3
#    r3 = r2
#    r2 = a

#4站就去掉第3个注释
t1 = (r1/c) - (r2/c)
t2 = (r1/c) - (r3/c)
#t3 = (r1/c) - (r4/c)

#四站就去掉第3个注释
print(t1)
print(t2)
#print(t3)